app/controllers/home_controller.rb

  def index
    @news = New.all
---
SELECT `news`.* FROM `news`