app/controllers/home_controller.rb

  def index
    @posts = Post.all
    @categories = Category.all
---
SELECT `posts`.* FROM `posts`
SELECT `categories`.* FROM `categories`