app/controllers/news_controller.rb

  def index
    @news = New.all
---
SELECT `news`.* FROM `news`

    def set_news
      @news = New.find(params[:id])
---
SELECT  `news`.* FROM `news`  WHERE `news`.`id` = 1 LIMIT 1