app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
---
  def index
    cat = params[:category]
    if  cat!= 'Home' and cat!=nil
      @posts = Post.where(:category => cat )
    else
      keywords = params[:keywords]
      if keywords!=nil
        where_clause = "( title LIKE ? OR description LIKE ? OR content LIKE ?)"
        @posts = Post.where(where_clause, '%'+keywords+'%','%'+keywords+'%','%'+keywords+'')
      else
        @posts = Post.all

INSERT INTO `posts` (`content`, `created_at`, `name`, `title`, `updated_at`) VALUES ('ededede', '2015-04-14 08:12:17', 'dse', 'eddede', '2015-04-14 08:12:17')
---
  def create
    @post = Post.new(post_params)
    @post.status = "pending"
    @post.userId = current_user.id
    @post.votes = 0
    @post.numComments = 0
    @post.save

UPDATE `posts` SET `content` = 'Hace pocos minutos el surfista nacional Carlos “Cali” Muñoz se despidió del Burton Automotive Pro Men´s, que se disputa desde el pasado lunes en Australia.', `name` = 'Gerardo Montoya', `title` = 'Torneo de surf en Costa Rica ', `updated_at` = '2015-04-15 08:33:24' WHERE `posts`.`id` = 3
---
  def update
    @post.update(post_params)

DELETE FROM `posts` WHERE `posts`.`id` = 2
---
  def destroy
    @post.destroy

SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 2 LIMIT 1
---
    def set_post
      @post = Post.find(params[:id])