app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @products = Product.all

INSERT INTO `products` (`created_at`, `description`, `name`, `price`, `updated_at`) VALUES ('2015-04-19 11:48:26', 'mucho', 'hola', 20003, '2015-04-19 11:48:26')
---
  def create
    @product = Product.new(product_params)
    @product.save

UPDATE `products` SET `description` = 'mucho\r\n', `updated_at` = '2015-04-19 11:50:52' WHERE `products`.`id` = 2
---
  def update
    @product.update(product_params)

DELETE FROM `products` WHERE `products`.`id` = 1
---
  def destroy
    @product.destroy

SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 2 LIMIT 1
---
    def set_product
      @product = Product.find(params[:id])